; domain
(define (domain blocksworld)
  (:requirements :strips :constraints :negative-preconditions)
  (:predicates (pred_2 ?v2)
               (pred_5 ?v2)
               (pred_4)
               (pred_1 ?v2)
               (pred_3 ?v2 ?v4))

  (:action op_4
    :parameters (?v3)
    :precondition (and (pred_2 ?v3) (pred_5 ?v3) (pred_4))
    :effect (and (pred_1 ?v3) (not (pred_2 ?v3)) (not (pred_5 ?v3)) 
                 (not (pred_4))))

  (:action op_1
    :parameters  (?v3)
    :precondition (pred_1 ?v3)
    :effect (and (pred_2 ?v3) (pred_4) (pred_5 ?v3) 
                 (not (pred_1 ?v3))))

  (:action op_3
    :parameters  (?v3 ?v1)
    :precondition (and (pred_2 ?v1) (pred_1 ?v3))
    :effect (and (pred_4) (pred_2 ?v3) (pred_3 ?v3 ?v1)
                 (not (pred_2 ?v1)) (not (pred_1 ?v3))))

  (:action op_2
    :parameters  (?v3 ?v1)
    :precondition (and (pred_3 ?v3 ?v1) (pred_2 ?v3) (pred_4))
    :effect (and (pred_1 ?v3) (pred_2 ?v1)
                 (not (pred_3 ?v3 ?v1)) (not (pred_2 ?v3)) (not (pred_4)))))

; problem
(define (problem BW-rand-6)
(:domain blocksworld)
(:objects obj_06 obj_01 obj_03 obj_05 obj_02 obj_04 )
(:init
(pred_4)
(pred_5 obj_06)
(pred_5 obj_01)
(pred_3 obj_03 obj_01)
(pred_5 obj_05)
(pred_3 obj_02 obj_05)
(pred_3 obj_04 obj_02)
(pred_2 obj_06)
(pred_2 obj_03)
(pred_2 obj_04)
)
(:goal
(and
(pred_3 obj_01 obj_02)
(pred_3 obj_05 obj_04)
(pred_3 obj_02 obj_05))
)

(:constraints
  (sometime-before (pred_3 obj_05 obj_04) (pred_3 obj_01 obj_02))
)
)

; plan
1. (op_2 obj_03 obj_01)
   deleted: (pred_3 obj_03 obj_01) (pred_2 obj_03) (pred_4)
   added: (pred_1 obj_03) (pred_2 obj_01)
   goals met: 1 of 3
2. (op_1 obj_03)
   deleted: (pred_1 obj_03)
   added: (pred_2 obj_03) (pred_4) (pred_5 obj_03)
   goals met: 1 of 3
3. (op_2 obj_04 obj_02)
   deleted: (pred_3 obj_04 obj_02) (pred_2 obj_04) (pred_4)
   added: (pred_1 obj_04) (pred_2 obj_02)
   goals met: 1 of 3
4. (op_1 obj_04)
   deleted: (pred_1 obj_04)
   added: (pred_2 obj_04) (pred_4) (pred_5 obj_04)
   goals met: 1 of 3
5. (op_2 obj_02 obj_05)
   deleted: (pred_3 obj_02 obj_05) (pred_2 obj_02) (pred_4)
   added: (pred_1 obj_02) (pred_2 obj_05)
   goals met: 0 of 3
6. (op_1 obj_02)
   deleted: (pred_1 obj_02)
   added: (pred_2 obj_02) (pred_4) (pred_5 obj_02)
   goals met: 0 of 3
7. (op_4 obj_01)
   deleted: (pred_2 obj_01) (pred_5 obj_01) (pred_4)
   added: (pred_1 obj_01)
   goals met: 0 of 3
8. (op_3 obj_01 obj_02)
   deleted: (pred_2 obj_02) (pred_1 obj_01)
   added: (pred_4) (pred_2 obj_01) (pred_3 obj_01 obj_02)
   goals met: 1 of 3
9. (op_4 obj_05)
   deleted: (pred_2 obj_05) (pred_5 obj_05) (pred_4)
   added: (pred_1 obj_05)
   goals met: 1 of 3
10. (op_3 obj_05 obj_04)
   deleted: (pred_2 obj_04) (pred_1 obj_05)
   added: (pred_4) (pred_2 obj_05) (pred_3 obj_05 obj_04)
   goals met: 2 of 3
11. (op_2 obj_01 obj_02)
   deleted: (pred_3 obj_01 obj_02) (pred_2 obj_01) (pred_4)
   added: (pred_1 obj_01) (pred_2 obj_02)
   goals met: 1 of 3
12. (op_1 obj_01)
   deleted: (pred_1 obj_01)
   added: (pred_2 obj_01) (pred_4) (pred_5 obj_01)
   goals met: 1 of 3
13. (op_4 obj_02)
   deleted: (pred_2 obj_02) (pred_5 obj_02) (pred_4)
   added: (pred_1 obj_02)
   goals met: 1 of 3
14. (op_3 obj_02 obj_05)
   deleted: (pred_2 obj_05) (pred_1 obj_02)
   added: (pred_4) (pred_2 obj_02) (pred_3 obj_02 obj_05)
   goals met: 2 of 3
15. (op_4 obj_01)
   deleted: (pred_2 obj_01) (pred_5 obj_01) (pred_4)
   added: (pred_1 obj_01)
   goals met: 2 of 3
16. (op_3 obj_01 obj_02)
   deleted: (pred_2 obj_02) (pred_1 obj_01)
   added: (pred_4) (pred_2 obj_01) (pred_3 obj_01 obj_02)
   goals met: 3 of 3
